# Zero Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..Zero Property
XYZ Class See Also
---
The coordinate origin or zero vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static XYZ Zero { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Zero As XYZ
	Get
```

Visual C++
---
```text
public:
static property XYZ^ Zero {
	XYZ^ get ();
}
```

# Remarks
The zero vector is (0,0,0).
# See Also
XYZ Class
Autodesk.Revit.DB Namespace